#ifndef __CHALLENGE_H__
#define __CHALLENGE_H__

//よく使う型を定義
typedef signed char s8;
typedef signed short s16;
typedef signed int s32;
typedef signed long long s64;
typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long long u64;
typedef size_t size;

static_assert(sizeof(s8) == 1);
static_assert(sizeof(s16) == 2);
static_assert(sizeof(s32) == 4);
static_assert(sizeof(s64) == 8);
static_assert(sizeof(u8) == 1);
static_assert(sizeof(u16) == 2);
static_assert(sizeof(u32) == 4);
static_assert(sizeof(u64) == 8);
static_assert(sizeof(size) == 8);


//----------------------
//1章
//----------------------
class Challenge1
{
public:
	int run(int argc, char* argv[]);
};
class Challenge2
{
public:
	int run(int argc, char* argv[]);
};
class Challenge3
{
public:
	int run(int argc, char* argv[]);
};
class Challenge4
{
public:
	int run(int argc, char* argv[]);
};
class Challenge5
{
public:
	int run(int argc, char* argv[]);
};
class Challenge6
{
public:
	int run(int argc, char* argv[]);
};
class Challenge7
{
public:
	int run(int argc, char* argv[]);
};
class Challenge8
{
public:
	int run(int argc, char* argv[]);
};
class Challenge9
{
public:
	int run(int argc, char* argv[]);
};
class Challenge10
{
public:
	int run(int argc, char* argv[]);
};
class Challenge11
{
public:
	int run(int argc, char* argv[]);
};
class Challenge12
{
public:
	int run(int argc, char* argv[]);
};
class Challenge13
{
public:
	int run(int argc, char* argv[]);
};
class Challenge14
{
public:
	int run(int argc, char* argv[]);
};


#endif//__CHALLENGE_H__
